{"conv_id": "h7ib64c", "conversation": [{"text": "Telling people (particularly kids) no you can't fly my drone\nWhat am I supposed to say when some little kid comes up to me and sometimes adults too, and asks to fly my drone. I am supposed to just say no or what reason should I give if they ask why? So far some kids have been persistent in flying so what am I supposed to say then?", "author": "Author_0", "timestamp": "2021-08-02 13:55:32", "sentiment": "negative"}, {"text": "Just say no, especially if you don't know them. If they persist, as if they would let someone drive their car who didn't know how to drive. And if a kid is persistent, you can just ignore them, because they are a child lol. Drones are expensive and take skill to fly, it's not like letting someone try out a video game or something. I let some people fly my drone, but only when I offered because I knew the person was responsible and would listen. Even my \"cheap\" Mini 2 cost too much money to just let anyone fly, especially kids or people I don't know.", "author": "Author_1", "timestamp": "2021-08-03 02:40:00", "sentiment": "negative"}, {"text": "I fly the mini 2 as my choice and I would not consider it cheap as it costs nearly 2 paychecks. Plus with all my addons is well over 700$. I don't consider it a toy", "author": "Author_0", "timestamp": "2021-08-03 02:48:22", "sentiment": "negative"}, {"text": "I wouldn't consider it cheap either, I put it in quotations because while it's cheap relative to other drones, it's really not all that cheap. Even if it was only $50 you still shouldn't feel obligated to let anyone else fly it if you don't want them to. It's your drone, if they want one they can get one or find someone else who will let them fly theirs.", "author": "Author_1", "timestamp": "2021-08-03 02:51:10", "sentiment": "negative"}]}
{"conv_id": "hm0ihay", "conversation": [{"text": "The 'Dronut' is a Cylindrical Drone Straight Out of Science Fiction", "author": "Author_0", "timestamp": "2021-11-25 02:51:34", "sentiment": "negative"}, {"text": "..an Imperial probe droid.", "author": "Author_1", "timestamp": "2021-11-25 07:28:39", "sentiment": "neutral"}, {"text": "My first thought was this, ready to self destruct", "author": "Author_2", "timestamp": "2021-11-25 08:33:41", "sentiment": "negative"}]}
{"conv_id": "hx7gid5", "conversation": [{"text": "Drone insurance. DJI Refresh doesn't appeal available for the Mavic line.\nJust curious if anybody here thinks drone insurance is worth it. I am a first time flyer. I bought a mini 2 and went to DJI's website and their refresh plan is only available for their larger drones. Anybody have any insight or suggestions?\n\n**So it appears that it is offered for the Mavic lineup and my google abilities need improvement.**", "author": "Author_0", "timestamp": "2022-02-16 18:39:28", "sentiment": "neutral"}, {"text": "**Also seeing how highly people are speaking about the DJI care plan, I will definitely get that. Thanks!**\n\nEdit: I am not really looking for liability insurance, more replacement insurance (if that is at all even available) and I live in Canada.", "author": "Author_0", "timestamp": "2022-02-16 18:39:28", "sentiment": "positive"}, {"text": "Another thing to consider with insurance is liability. I got insurance for my drone that I use for work because I’m the event I crash and either hurt someone or something, I’m sufficiently covered. I went thru my professional insurer for this.", "author": "Author_1", "timestamp": "2022-02-16 18:42:05", "sentiment": "neutral"}, {"text": "Fair enough. I will consider it. I am going to use it for landscape photography and plan on only flying it in the middle of nowhere but I suppose there is a slight chance it lands on a hiker or something.", "author": "Author_0", "timestamp": "2022-02-16 18:50:33", "sentiment": "neutral"}, {"text": "Then in that case maybe it’s not worth it. I’ll be using it first 3D scanning, so I’ll be in and around buildings in dense urban areas.", "author": "Author_1", "timestamp": "2022-02-16 18:53:53", "sentiment": "neutral"}]}
{"conv_id": "iwisggu", "conversation": [{"text": "Got stopped while flying my drone by a cop\nSo I was using my drone to capture some pictures of this event I was hired for. And a cop came over and immediately told me to “land it” and I was like ok. Then he asked me for ID, which I gave it to him and then he called the event organizer and eventually gave me my ID back and let me fly my drone again. I was no where near a restricted flight zone and was even using a drone below 249 grams.\nI honestly felt like he abused his power, lost valuable time to capture more pictures, lost a bit of sunlight, and the cop was very mean throughout the whole thing. Could I have refused giving my ID to the cop? Isn’t that only when there’s suspicion of a crime? And did I have to forcefully land my drone just because the cop told me so?", "author": "Author_0", "timestamp": "2022-11-15 17:04:49", "sentiment": "negative"}, {"text": "Yes, you did.  Cops have the authority to ask you for your Part 107 license and ID if they see you flying anywhere.", "author": "Author_1", "timestamp": "2022-11-15 19:11:57", "sentiment": "neutral"}, {"text": "The cops don't enforce the FAA laws. No one that I've heard of or read about has been ticketed for flying commercially without a 107. Sources I'll read though.", "author": "Author_2", "timestamp": "2022-11-15 19:33:22", "sentiment": "neutral"}, {"text": "Dig through the r/drone history. The FAA reps come on here periodically, as do the cops, to let us know what they enforce and what they don't. I live in NYC and there's no flying except in the RC parks. Cops here do get called and do take drones. But, NYC is unique. Most other cities don't have this law.", "author": "Author_2", "timestamp": "2022-11-15 19:33:22", "sentiment": "neutral"}, {"text": "107.7 Inspection, testing, and demonstration of compliance.\n\n(a) A remote pilot in command, owner, or person manipulating the flight controls of a small unmanned aircraft system must - \n\n(1) Have in that person's physical possession and readily accessible the remote pilot certificate with a small UAS rating and identification when exercising the privileges of that remote pilot certificate.", "author": "Author_3", "timestamp": "2022-11-15 20:02:46", "sentiment": "neutral"}, {"text": "(2) Present his or her remote pilot certificate with a small UAS rating and identification that contains the information listed at § 107.67(b)(1) through (3) for inspection upon a request from - \n\n(i) The Administrator; \n\n(ii) An authorized representative of the National Transportation Safety Board; \n\n(iii) Any Federal, State, or local law enforcement officer; or \n\n(iv) An authorized representative of the Transportation Security Administration.", "author": "Author_3", "timestamp": "2022-11-15 20:02:46", "sentiment": "neutral"}, {"text": "Thanks, that doesn't contradict anything I said though. If a cop asks you ANYTHING, you do it or you deal with consequences. I've had cops say to me, after asking which law was broke, \".. you and your gear will be in my squad car if I tell you.\"Do you have to show your 107.. yes. If you don't have it.. show me that Federal FAA law that results in penalites (again, excluding NYC, which is a 100% no fly area, and cops enforce that with or without a 107!).", "author": "Author_2", "timestamp": "2022-11-15 20:10:17", "sentiment": "negative"}, {"text": "There's no FAA police running around looking for commercial drone pilots who don't have 107's. This is from an FAA rep, who also stated that they don't really care what you do unless its a violation that hurts people.  I've no idea how to search my profile, but the FAA, and the cops, and I have had some great lengthy conversations posted here.", "author": "Author_2", "timestamp": "2022-11-15 20:10:17", "sentiment": "neutral"}, {"text": "EDIT: [Here's an FAA rep explaining this]([URL] Keep downvoting, I'm simply trying to give practical advice. YES, you should get your 107 if you're doing anything commercial. FFS!\n\nEDIT 2: Ok. I stand corrected. Here's a video. The #1 case prosecuted by the FAA is no 107. [URL]", "author": "Author_2", "timestamp": "2022-11-15 20:10:17", "sentiment": "negative"}, {"text": "I narrowly escaped getting busted by cops. I flew my drone in hollywood and right after I landed there were 3 cops patrolling the area asking people including me if they were flying a drone. Still have no idea how they knew exactly where I was. The cops are obviously doing some type of enforcement.", "author": "Author_4", "timestamp": "2022-11-15 21:43:21", "sentiment": "negative"}, {"text": "Careful out there. A cop on r/drones explained the hell you'd be put through in NYC at least, if the cops find you. I've had many close calls, and typically am literally, flying only over desolate areas, LOS, spotter, basically as safe as I can! P[osted this video above]([URL] that sheds a bit more light on the FAA's practical ground game. I love that there's on part of this where the FAA is dealing with pilots arguing, LOL, can't make this up.", "author": "Author_2", "timestamp": "2022-11-15 23:02:18", "sentiment": "negative"}]}
{"conv_id": "cpvz1gp", "conversation": [{"text": "Amazon tests delivery drones at secret Canada site after US frustration", "author": "Author_0", "timestamp": "2015-03-30 13:28:19", "sentiment": "negative"}, {"text": "Even though this is being tested here, and the Canadian government is letting them do it.\n\nIt's launch would be just as spotty as Google Fiber's in the US... some cities at once and only for the ones that will even allow it.\n\nToronto or Vancouver first more than likely...", "author": "Author_1", "timestamp": "2015-03-30 17:54:08", "sentiment": "neutral"}, {"text": "As long as it comes to Edmonton at some point...", "author": "Author_2", "timestamp": "2015-03-30 21:44:28", "sentiment": "neutral"}]}
{"conv_id": "e2z1pbx", "conversation": [{"text": "Playing around with my new drone. I think this video turned out pretty cool!", "author": "Author_0", "timestamp": "2018-07-24 01:58:48", "sentiment": "positive"}, {"text": "Cool! What drone?", "author": "Author_1", "timestamp": "2018-07-24 22:40:08", "sentiment": "positive"}, {"text": "DJI Mavic Air. I really like the sensors on it vs the Pro being a first time pilot.", "author": "Author_0", "timestamp": "2018-07-24 22:40:43", "sentiment": "positive"}]}
{"conv_id": "grcu68y", "conversation": [{"text": "UAE to test cloud-busting drones to boost rainfall", "author": "Author_0", "timestamp": "2021-03-18 05:19:20", "sentiment": "neutral"}, {"text": "I’m no expert , but will this cause cloud diplomacy issues, such as one country bursts all the rain in their own country, leaving nothing for a subsequent neighboring country with no rain?", "author": "Author_1", "timestamp": "2021-03-18 10:02:45", "sentiment": "neutral"}, {"text": "Kim Stanley Robinson - Ministry for the Future. Listen to a recent podcast on the Ezra Klein Show where he talks about it to get a quick hit out and an excellent discussion on it and related issues. Highly recommend both", "author": "Author_2", "timestamp": "2021-03-18 13:38:06", "sentiment": "neutral"}]}
{"conv_id": "dc3rc77", "conversation": [{"text": "Looking to buy a drone in the next few weeks, can you give me some insight?\nHi all!", "author": "Author_0", "timestamp": "2017-01-07 00:28:10", "sentiment": "positive"}, {"text": "I have been looking at drones for the past few weeks and can't decide what I want to buy. I have never owned a drone (beginner!) but I think I can pick things up quickly after watching all of the videos I have. I'm looking to spend between $700-$1000. Initially I thought I'd get the Phantom 4, then I started reading things that basically said a phantom 3 advanced/pro would be plenty of drone for what I'd use it for (just fun mostly, I like to travel and make videos), so I did some more research into those. After doing all of that, I read the horror stories of DJI's customer service. If I'm spending that much money on something, I'd like the company to support it. I then found the Autel X Star Premium and felt like it might be a good fit for me. Can anybody provide any insights as to what the best drone in that range might be? The P3A/P3P seem to be right around $799 most of the time and the Autel is at $749. Or is the P4 worth the extra $2-300? I'm also interested in the Mavic Pro due to its portability but I don't want the portability to impact it's usability (if that makes any since), and it still has the DJI support problem. Any help is appreciated!", "author": "Author_0", "timestamp": "2017-01-07 00:28:10", "sentiment": "neutral"}]}
{"conv_id": "eno8esp", "conversation": [{"text": "I CRASHED MY HUMAN LIFTING DRONE ON SECOND TEST FLIGHT", "author": "Author_0", "timestamp": "2019-05-15 10:54:36", "sentiment": "negative"}, {"text": "And that folks, is why you practice in a safe and open area.", "author": "Author_1", "timestamp": "2019-05-15 11:22:25", "sentiment": "neutral"}, {"text": "It's also why we are getting banned from virtually everywhere.", "author": "Author_2", "timestamp": "2019-05-15 16:30:08", "sentiment": "negative"}, {"text": "This is a far cry from hobbiest drones. \n\nDoesn't the FAA regulate homemade aircraft? Is doing something like this legal in any way? My guess would be that building this thing and flying it in your backyard would be wildly illegal.", "author": "Author_3", "timestamp": "2019-05-15 21:23:12", "sentiment": "negative"}, {"text": "Not sure about the US. But here if it's over a certain weight and flies under its own power it needs to be registered.", "author": "Author_4", "timestamp": "2019-05-15 21:35:12", "sentiment": "neutral"}]}
{"conv_id": "e0eyyhc", "conversation": [{"text": "I'm going to Yellowstone, should I even bother bringing my P4?\nI wouldn't even consider taking the chance of getting busted flying in the park, 90% of our trip is IN the parks (YS and Tetons), should I even bother packing the drone? Thoughts?", "author": "Author_0", "timestamp": "2018-06-10 00:33:21", "sentiment": "neutral"}, {"text": "Unless you get permission from the park, it's not allowed in the park", "author": "Author_1", "timestamp": "2018-06-10 01:09:58", "sentiment": "negative"}, {"text": "Right, but what about surrounding areas?", "author": "Author_0", "timestamp": "2018-06-10 02:04:07", "sentiment": "neutral"}, {"text": "I took my mavic to USA and flew outside parks, some cool areas still follow the rules. the b4ufly app is really also useful.", "author": "Author_2", "timestamp": "2018-06-10 03:25:55", "sentiment": "neutral"}]}
{"conv_id": "fd4qux3", "conversation": [{"text": "[Serious] Question: Window washing drone? A friend in NYC has a beautiful view from work, but filthy windows that can't be cleaned from inside, and building won't wash them. Is there a drone that could be used to wash their 2 office windows? Anyone for hire?\nP.S. 11th floor. \nThanks for all the responses, everyone. I've learned a lot and it sounds like it's not possible, but please keep the conversation flowing if there's more to say", "author": "Author_0", "timestamp": "2020-01-03 20:09:36", "sentiment": "neutral"}, {"text": "I think a magnetic washing solution would be better. Something like this:  [[URL]", "author": "Author_1", "timestamp": "2020-01-03 20:41:52", "sentiment": "neutral"}, {"text": "I agree if this is possible, it might not be a window they can open though and then they have no choice.", "author": "Author_2", "timestamp": "2020-01-03 20:53:07", "sentiment": "neutral"}]}
{"conv_id": "h9qd5cb", "conversation": [{"text": "New drone crashed\nI just bought a mavic air about 2 weeks ago and I've been learning the ropes. I took it off beginner mode and really started to enjoy the freedom. So I decided for it to return to home to see how the feature works. The drone shot up in the air like a missile taking off and hit some tree fell 25ft crashing down on its back side while the motors are still spinning on high speed totally destroying the propellers. Is there a factory warranty on dji drones?", "author": "Author_0", "timestamp": "2021-08-20 22:00:37", "sentiment": "negative"}, {"text": "Did you get the care plan when you bought it? Of not sadly you are out of luck.", "author": "Author_1", "timestamp": "2021-08-20 22:09:56", "sentiment": "negative"}, {"text": "Amazon told me to keep the drone and refunded my money. 🤷🏾‍♂️", "author": "Author_0", "timestamp": "2021-08-20 22:54:48", "sentiment": "negative"}, {"text": "Oh damn, you got lucky. Learn about how the RTH works, this has got a lot of people.", "author": "Author_1", "timestamp": "2021-08-21 00:32:57", "sentiment": "positive"}]}
{"conv_id": "gm5brs2", "conversation": [{"text": "I wanted to star a discussion related to drone videos, duration of the shots and over all video\nHi, as the title explains I want to hear your opinion about drone videos.\n- how long should a video be (edited) 30 sec to short? 3 minutes? 10 minutes too long that can get boring? I would like to know what works best for you.", "author": "Author_0", "timestamp": "2021-02-05 18:59:22", "sentiment": "neutral"}, {"text": "- how long should a single shot be? I’m not talking about fpv manoeuvres, we all know how exiting and not boring at all can they be, I mean cinematic movements, I’ve seen videos with a minute long shots and feels forever, sometimes even 20 sec shots feel too long for me.\n\n-how much editing is ok?  Do you feel like fast edits and edit tricks add to the video o do you prefer clean shots mostly color corrected?", "author": "Author_0", "timestamp": "2021-02-05 18:59:22", "sentiment": "neutral"}, {"text": "————————————————————————-\n\nIf there is anything else you would like to add to the discussion please do, if it gets enough attention I’ll ad it to the description. \n\nThanks everyone", "author": "Author_0", "timestamp": "2021-02-05 18:59:22", "sentiment": "neutral"}]}
{"conv_id": "ebli6yh", "conversation": [{"text": "consumer drone for making detailed land maps?\nI'm trying to make detailed maps of some heavily forested rural land, anywhere from 2 acres to 60 acres.\n\nThe DJI drones do have a feature that seems to do exactly what I want, but it looks like it is a paid add-on in the app. Is that true? How much is it? Does it work pretty well?\n\n[URL]#body\n\nAre there any other drones with this type of functionality?", "author": "Author_0", "timestamp": "2018-12-11 20:01:34", "sentiment": "neutral"}, {"text": "My goal with these maps is to get more information about the land. I want to figure out which areas have standing water, the different types of trees or vegetation, and ideally get a little bit of elevation/slope data.\nI would use this data to determine where the buildable areas are.", "author": "Author_0", "timestamp": "2018-12-11 20:01:34", "sentiment": "neutral"}, {"text": "You can get Pix4D capture app to do the flight profile for free.  You typically do an 80% grid overlap one complete set of passes at nadir, which is the camera straight down and a second set of passes with the camera at a 60 degree tilt angle.  You can get a 15 day free trial of Pix4D to make the map.  The process is intense, so you need a decent computer, at least 8 Gigs of RAM and a decent processor.  \n\n&amp;#x200B;", "author": "Author_1", "timestamp": "2018-12-11 23:17:56", "sentiment": "neutral"}, {"text": "For what you want to do, it sounds like you need a drone that has the camera modified for NVDI by comparing vegetation and areas that have more water.", "author": "Author_1", "timestamp": "2018-12-11 23:17:56", "sentiment": "neutral"}, {"text": "Nice, thanks for the suggestion. I'll check it out.\n\nDo you think that the DJI Phantom 4 Pro v2 or Mavic 2 are still the best drones to get if I'm using this other software?\n\nre: NVDI, I was just planning on manually going over the photos and identifying different areas of vegetation / water. I don't need that to be automated.", "author": "Author_0", "timestamp": "2018-12-11 23:36:18", "sentiment": "neutral"}]}
{"conv_id": "iuw3b5k", "conversation": [{"text": "Is it illegal to fly a drone near a construction site for recreational purposes?", "author": "Author_0", "timestamp": "2022-11-03 11:41:36", "sentiment": "neutral"}, {"text": "Its situational and could vary depending upon where you live and who owns the site but I would generally its a bad idea without having more info than you gave.", "author": "Author_1", "timestamp": "2022-11-03 11:48:18", "sentiment": "neutral"}, {"text": "Agreed- better to communicate first. If it’s truly recreational, you could gain some good will by offering them the footage afterwards.", "author": "Author_2", "timestamp": "2022-11-03 12:06:19", "sentiment": "neutral"}, {"text": "If you offer them footage, it is no longer a recreational flight.", "author": "Author_3", "timestamp": "2022-11-03 12:32:32", "sentiment": "neutral"}, {"text": "Only if money or some other form of payment or compensation is involved. You only get in trouble if you 'sell' the video. \n\nI shot video of my citys water tower (with permission) and I offered it to them to use.", "author": "Author_4", "timestamp": "2022-11-03 13:01:06", "sentiment": "neutral"}, {"text": "This is incorrect. The intent of the flight is what matters. If you fly with the intent to use the footage for anything other than recreation, you need to have a Part 107. Money doesn’t matter. If you have a friend who is a realtor, you can’t fly a property they’re selling and give them the footage to use. Even if they don’t pay you.", "author": "Author_5", "timestamp": "2022-11-03 13:12:37", "sentiment": "negative"}, {"text": "Sounds like that would be an obvious loophole so that makes sense.", "author": "Author_6", "timestamp": "2022-11-03 13:23:56", "sentiment": "neutral"}]}
{"conv_id": "dqceci9", "conversation": [{"text": "Several questions for a DIY drone build\nI am building a hexacopter w/ 2200kv brushless motors and I’m planning on adding a claw that can pick up trash. I️ have several questions...\n   1. Can I️ add a telemetry radio and a video transmitter or would they interfere with each other?\n   2. If I️ wanted to add some sort of claw (remote control) that could have practical uses such as picking up trash would it be possible? How could I do it?\n   3. Does the RC transmitter (e.g. Taranis/Quanum) have to correspond with the receiver. Like, do they have to come in a set?", "author": "Author_0", "timestamp": "2017-11-26 02:29:32", "sentiment": "neutral"}, {"text": "All easy questions.\n1. Yes you can run a telemetry and a video transmitter so long as they operate on different frequencies. I would recommend locating them at opposite ends of your quad.\n2. Yes you could put a claw. It would need it's own channel so you can flip a switch and open and close it. Flite test did this recently however, they used a second transmitter/receiver to control the claw.\n3. Yes, they receiver must match the transmitter. That being said, there are off brand receivers that are cheaper and are designed to operate with the name brand.", "author": "Author_1", "timestamp": "2017-11-26 02:43:56", "sentiment": "neutral"}, {"text": "Thank you, really appreciate it. I️’ll check out Flite Test’s channel.", "author": "Author_0", "timestamp": "2017-11-26 02:47:39", "sentiment": "positive"}]}
{"conv_id": "hcwtrgy", "conversation": [{"text": "Hi! New to drones and was looking for trustworthy sites to buy from if anyone can give a list.\nTitle says it all! Much appreciated.", "author": "Author_0", "timestamp": "2021-09-15 02:13:18", "sentiment": "positive"}, {"text": "Racedayquads.com. Getfpv.com those are the two I use the most. I’ve used Banggood.com but their shipping can be slow, just gotta make sure your product is shipping from inside the USA", "author": "Author_1", "timestamp": "2021-09-15 04:04:55", "sentiment": "neutral"}, {"text": "Thank you, Much appreciated! I'm looking to get a tango 2 but they seem to be sold out or on backorder everywhere!", "author": "Author_0", "timestamp": "2021-09-15 04:08:59", "sentiment": "positive"}]}
{"conv_id": "d1qri3l", "conversation": [{"text": "US Army hopes to outfit soldiers with tiny drones by 2018", "author": "Author_0", "timestamp": "2016-04-05 08:56:18", "sentiment": "neutral"}, {"text": "Is this one of those really cool things they put in all the recruiter videos, and then actually give our troops the equivalent of sharpened sticks when it comes to actual deployment?", "author": "Author_1", "timestamp": "2016-04-05 15:04:39", "sentiment": "negative"}]}
{"conv_id": "coit85e", "conversation": [{"text": "This Is How You Race a Drone in the Snow (FPV)", "author": "Author_0", "timestamp": "2015-02-11 13:40:18", "sentiment": "neutral"}, {"text": "I love drone races! I would totally watch them as a sport. Anybody got more videos?", "author": "Author_1", "timestamp": "2015-02-11 23:50:54", "sentiment": "positive"}, {"text": "[Here's my promo for Chicago.]([URL]", "author": "Author_2", "timestamp": "2015-02-12 02:13:29", "sentiment": "neutral"}]}
{"conv_id": "fraqfg3", "conversation": [{"text": "Stories wanted: Anyone caught breaking laws with a UAV either 1st-hand or 2nd-hand stories. What happened? What was the law enforcement able to do?\nNo crime is being planned.  What are your stories?", "author": "Author_0", "timestamp": "2020-05-18 00:46:38", "sentiment": "neutral"}, {"text": "My neighbors child flew his walmart quad (phantom size but much lighter) into the street and hit a car causing them to swerve and hit the median.. unfortunately, the quad was picked up by the driver and held hostage till the cops came.. and his dumbass dad put all their information on it with a label maker..  \nThe kid was yelled at by the driver, and he ran inside, dad came back out and started fighting with the driver about yelling at his kid..", "author": "Author_1", "timestamp": "2020-05-18 01:16:05", "sentiment": "negative"}, {"text": "Long story shorter, the cop came, put the dad in cuffs and detained him until the FAA rep handled it. He was let go, and ended up in court with a bunch of charges / fines.. he never went to jail but got probation and community service for causing an accident / great bodily injury for a broken bone.. it was absolutely crazy the amount of stuff he went through for his kid not listening..", "author": "Author_1", "timestamp": "2020-05-18 01:16:05", "sentiment": "negative"}, {"text": "Also my buddy got a huge ticket at the beach for flying his phantom 4 without registration or proof of registration.. and he was hit with a $2750 dollar fine. If he would have been caught flying over a public road would have been an additional fine of $25k.", "author": "Author_1", "timestamp": "2020-05-18 01:16:05", "sentiment": "negative"}, {"text": "and his dumbass dad put all their information on it with a label maker.\n\nIsn't that a legal requirement?", "author": "Author_2", "timestamp": "2020-05-18 07:26:57", "sentiment": "negative"}, {"text": "You only need to put down the registration number.", "author": "Author_3", "timestamp": "2020-05-18 18:43:10", "sentiment": "neutral"}, {"text": "Yep that's what I told him, but he never registered..", "author": "Author_1", "timestamp": "2020-05-21 01:23:52", "sentiment": "neutral"}]}
